RedditClone_w8d1/app/controllers/posts_controller.rb

    def new
        @post = Post.new
        @subs = Sub.all
---
SELECT "subs".* FROM "subs"

    def create
        @post = Post.new(post_params)
        @post.author_id = current_user.id
        #create a post_subs instance!!
        if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "cute kitty"], ["url", ""], ["content", "so cute"], ["sub_id", 2], ["author_id", 3], ["created_at", "2020-09-14 22:08:04.781076"], ["updated_at", "2020-09-14 22:08:04.781076"]]

    def update
        @post = current_user.posts.find_by(id: params[:id])
        if @post && @post.update(post_params)
---
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "so cutee"], ["updated_at", "2020-09-14 22:13:46.660937"], ["id", 1]]

    def destroy
        @post = current_user.posts.find_by(id: params[:id])
        if @post && @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 3]]