RedditClone_w8d1/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "cars "], ["description", "electric or gas"], ["moderator_id", 2], ["created_at", "2020-09-14 20:37:15.764537"], ["updated_at", "2020-09-14 20:37:15.764537"]]
---
    def create
        @sub = Sub.new(sub_params)
        @sub.moderator_id = current_user.id
        if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @sub = Sub.find_by(id: params[:id])

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "the best forum for all cute animals!!"], ["updated_at", "2020-09-14 21:00:55.908102"], ["id", 2]]
---
    def update
        @sub = Sub.find_by(id: params[:id])
        if @sub.update(sub_params)