w6d4/w6d4_art/alvin_me_routing_shit/app/controllers/artworks_controller.rb

    def index
        artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks"