w6d4/w6d4_art/alvin_me_routing_shit/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "age", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Brandon Bonzani"], ["age", 28], ["email", "appropriate_email@gmail.com"], ["created_at", "2020-09-03 21:29:27.047821"], ["updated_at", "2020-09-03 21:29:27.047821"]]
---
  def create
    user = User.new(user_params)

    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "age" = $2, "name" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["email", "banana@gmail.com"], ["age", 81], ["name", "Chong Alvin "], ["updated_at", "2020-09-02 23:59:13.547615"], ["id", 2]]
---
  def update
    user = User.find(params[:id])

    if user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 9]]
---
  def destroy
    user = User.find(params[:id])
    user.delete