w6d5/w6d5/app/controllers/cats_controller.rb

    def create
        @cat = Cat.new(cat_params) ##

        if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        @cat = Cat.find(params[:id])

        if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "sex" = $2, "description" = $3, "birth_date" = $4, "updated_at" = $5 WHERE "cats"."id" = $6  [["color", "black"], ["sex", "M"], ["description", "Harlow"], ["birth_date", "2020-01-30"], ["updated_at", "2020-09-04 23:56:34.564998"], ["id", 13]]