w7d2/w7d2/app/models/user.rb

   def reset_session_token!
        #generate a random session token
        self.session_token = SecureRandom::urlsafe_base64
        #save that session token with a bang
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "MHnP3AEDzaze4y-9cE4dSA"], ["updated_at", "2020-09-09 21:22:36.921203"], ["id", 1]]