RedditClone_w8d1/app/views/posts/new.html.erb

        <input type="hidden" name="post[sub_ids][]" value="">
        <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"