w7d2/w7d2/app/controllers/application_controller.rb

    def current_user                #col_name          hash[:12345]
        @current_user ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "V0rjHQjsNASCJpRFKLsVAA"], ["LIMIT", 1]]