w7d2/w7d2/app/controllers/bands_controller.rb

    def create
        @band = Band.new(band_params)
        if @band.save!
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Strokes"], ["created_at", "2020-09-09 23:36:58.256970"], ["updated_at", "2020-09-09 23:36:58.256970"]]